### 3.2 Functional Programming

==Scheme== is a dialect of Lisp, the second-oldest programing language.

* Only expressions(no statements)
* Specializes in symbolic computation
* Employs only immutable values



#### 3.2.1 Expressions

Scheme programs consist of expressions, which are either **call expressions** or **special forms**.

##### Call expressions

A call expression consists of operator expression followed by zero or more operand sub-expressions.

<u>Both the operator and operand are contained within parentheses</u>.

Scheme exclusively uses prefix notation.

Call expressions can be nested.

```scheme
(quotient 10 2)
5

(+ (* 3
      (+ (* 2 4)
         (+ 3 5)))
   (+ (- 10 7)
      6))
57
```

Scheme expressions may be primitives or combinations. Number literals are primitives, while call expressions are conbine forms that include arbitrary sub-expressions.

>  Evaluation procedure
>
> 1. Evaluate the operator and operand expressions
> 2. The function that is the value of the operator is applied to the arguments that are the values of the operands

##### Special from

`if` expression

```scheme
(if <predicate> <consequent> <alternative>)
```

If the `<predicate>` evaluates to a true value, the interpreter then evaluates the `<consequent>` and returns its value. Otherwise it evaluates the `<alternative>` and returns its value.

```scheme
(>= 2 1)
#t

(and <e1> ... <en>)
(or <e1> ... <en>)
(not <e>)
```



#### 3.2.2 Definitions

`define` special form

###### Name the values

```scheme
(define pi 3.14)
(* pi 2)
6.28
```



##### Define procedures(functions)

```scheme
(define (<name> <formal parmeters>) <body>)
```

* The `<name>` is a symbol to be associated with the procedure definition in the environment.
* The `<formal parameters>` are the names used within the body of the procedure to refer to the corresponding arguments.
* The `<body>` is an expression that will yield the value of the procedure application when the formal parameters are replaced by the actual arguments to which the procedure is applied. 
* The `<name>` and the `<formal parameters>` are grouped within parentheses, just as they would be in an actual call to the procedure being defined.

```scheme
(define (square x) (* x x))
(square 21)
441

(square(square 3))
81
```

##### local definitions

```scheme
(define (average x y)
  (/ (+ x y) 2))

(define (abs x)
    (if (< x 0)
        (- x)
        x))

(define (sqrt x)
  (define (good-enough? guess)
    (< (abs (- (square guess) x)) 0.001))
  (define (improve guess)
    (average guess (/ x guess)))
  (define (sqrt-iter guess)
    (if (good-enough? guess)
        guess
        (sqrt-iter (improve guess))))
  (sqrt-iter 1.0))

(sqrt 9)
3.00009155413138
```



##### Anonymous function

Anonymous functions are created using the `lambda` special form.

```scheme
(lambda (<formal-parameters>) <body>)
```

Equivalent:

```scheme
(define (plus4 x) (+ x 4))
(define plus4 (lambda (x) (+ x 4)))
```

Lambda expression used in call expression

```scheme
((lambda (x y z) (+ x y (square z))) 1 2 3)
;(operator                          operand )
```



#### 3.2.3 Compound values

Pairs are built into Scheme language.

Pairs are created with the `cons` and the elements of a pair are accessed with `car` and `cdr`

```scheme
(define x (cons 1 2))
x
(1 2)
(car x)
1
(cdr x)
2
```

##### Revursive list

Empty list: `nil` or `()`

```scheme
(cons 1
      (cons 2
            (cons 3
                  (cons 4 nil))))
(1 2 3 4)
(list 1 2 3 4)
(1 2 3 4)

; length and get item
(define (length items)
  (if (null? items)
      0
      (+ 1 (length (cdr items)))))
(define (getitem items n)
  (if (= n 0)
      (car items)
      (getitem (cdr items) (- n 1))))

(define squares (list 1 4 9 16 25))
(length squares)
5
(getitem squares 3)
16
```



#### 3.2.4 Symbolic Data

One of Scheme's strengths is working with arbitrary symbols as data.

==Quota== a data: quotation mark

```scheme
(define a 1)
(define b 2)
(list a b)
(1 2)
(list 'a 'b)
(a b)
(list 'a b)
(a 2)
```

In scheme, any expression that is not evaluated is said to be **quoted.**

```scheme
(car '(a b c))
a
(cdr '(a b c))
(b c)
```



#### 3.2.5 Turtle graphics

The `begin` special form in Scheme allows a single expression to include multiple sub-expressions. This form is useful for issuing multiple commands.

```scheme
> (define (repeat k fn) (if (> k 0)
                            (begin (fn) (repeat (- k 1) fn))
                            nil))
> (repeat 5
          (lambda () (fd 100)
                     (repeat 5
                             (lambda () (fd 20) (rt 144)))
                     (rt 144)))

> (define (repeat k fn)
    (if (> k 0)
        (begin (fn) (repeat (- k 1) fn))
        nil))

> (define (tri fn)
    (repeat 3 (lambda () (fn) (lt 120))))

> (define (sier d k)
    (tri (lambda ()
           (if (= k 1) (fd d) (leg d k)))))

> (define (leg d k)
    (sier (/ d 2) (- k 1))
    (penup)
    (fd d)
    (pendown))
```

* The `triangle` procedure is a general method for repeating a drawing procedure three times with a left turn following each repetition.
* The `sier` procedure takes a length `d` and a recursive depth `k`. It draws a plain triangle if the depth is 1, and otherwise draws a triangle made up of calls to `leg`.
* The `leg` procedure draws a single leg of a recursive Sierpinski triangle by a recursive call to `sier` that fills the first half of the length of the leg, then by moving the turtle to the next vertex.



#### 3.2.6 More special forms

* `if`
* `define`
* `lambda`

##### cond

The `cond`special form that behaves like if-elif-else statments in python.

```scheme
(cond ((> x 10) (print 'big))
      ((> x 5)  (print 'medium))
      (else     (print 'small)))
```

##### begin

The `begin` special form combines multiple expressions into one expression

```scheme
(if (> x 10) (begin
              (print 'big)
              (print 'guy))
    		 (begin
              (print 'small)
              (print 'fry)))
```

#### let

The `let` special form binds symbols to values temporarily; just for one expression..

```scheme
(define c (let ((a 3)
                (b (+ 2 2)))
            	(sqrt(+ (* a a) (* b b)))))
```



#### 3.2.7 Programs as data

The built-in scheme list data structure(linked list) can represent combinations.

```scheme
scm> (list 'quotient 10 2)
(quotient 10 2)
scm> (eval(list 'quotient 10 2))
5
```

In such a language, it is straightforward to write a program that writes a program.

##### Quasiquotation

Two ways to quote an expression:

```scheme
Quote:      '(a b) => (a b)
Quasiquote: `(a b) => (a b)
```

A quasoquoted expression can be unquoted with `,`

```scheme
(define b 4)
Quote:      '(a ,(+ b 1) => (a (unquote (+ b 1))
Quasiquote: `(a ,(+ b 1) => (a 5)
```

Quassiquotation is particularly convenient for generating Scheme expressions.